# Brew autoupdate
tap "domt4/autoupdate"

# Shell
cask "ghostty"
brew "starship"
brew "neovim"
brew "eza"
brew "bat"
brew "fd"
brew "fzf"
brew "lf"
brew "zoxide"
brew "ripgrep"
brew "carapace"

# Fonts
cask "font-meslo-lg-nerd-font"

# Git & GitHub
brew "git"
brew "lazygit"
brew "gh" 

# Utilities
brew "jq"
brew "yq"
brew "nmap"
brew "chezmoi"
brew "dockutil"

# Apps
cask "firefox"
cask "rectangle"
cask "zed"

# Security
cask "secretive"
cask "yubico-authenticator"

# Cloud & IaC
brew "awscli"
brew "granted"
brew "tfenv"

