tap "domt4/autoupdate"

# Shell
brew "z"

# Git & GitHub
brew "git"
brew "gh"

# Cloud & IaC
brew "awscli"
brew "tfenv"
brew "yor"

# Python
brew "pyenv"
brew "pyenv-virtualenv"
brew "uv"

# Node
brew "node"
brew "nvm"
brew "yarn"

# Containers
brew "podman"

# CI
brew "act"
brew "actionlint"

# Utilities
brew "jq"
brew "yq"
brew "nmap"
brew "pandoc"
brew "chezmoi"
brew "openjdk"
brew "dockutil"

# Fonts
cask "font-meslo-lg-nerd-font"

# Casks
cask "1password-cli"
cask "firefox"
cask "iterm2"
cask "rectangle"
cask "zed"

